In [5]:
import pandas as pd

In [13]:
df1 = pd.DataFrame({
    'key' : ['a', 'b', 'c', 'd', 'e'],
    'A1' : range(5),
    'B1' : range(5, 10),
})

df2 = pd.DataFrame({
    'key' : ['a', 'b', 'c'],
    'A2' : range(3),
    'B2' : range(3, 6),
})

In [9]:
df1

  key  A1  B1
0   a   0   5
1   b   1   6
2   c   2   7
3   d   3   8
4   e   4   9

In [15]:
df2

  key  A2  B2
0   a   0   3
1   b   1   4
2   c   2   5

In [16]:
pd.merge(df1, df2, how='left', on='key')

  key  A1  B1   A2   B2
0   a   0   5  0.0  3.0
1   b   1   6  1.0  4.0
2   c   2   7  2.0  5.0
3   d   3   8  NaN  NaN
4   e   4   9  NaN  NaN